Brumaombra/led-matrix-bitcoin-ticker-esp8266/src/main.cpp
	// Price
	tempVal = doc[0]["price"].as<double>();
	tempVal2 = doc[0]["changesPercentage"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	formatCurrency(tempVal2, tempString2, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessagePrice, BUF_SIZE, " BTC: $ %s (%s%%)", tempString, tempString2);

	// Daily Change
	tempVal = doc[0]["change"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageDailyChange, BUF_SIZE, "Daily Change: $ %s", tempString);

	// Market cap
	tempVal = doc[0]["marketCap"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageMarketCap, BUF_SIZE, "Market Cap: $ %s", tempString);

	// Daily High/Low
	tempVal = doc[0]["dayHigh"].as<double>();
	tempVal2 = doc[0]["dayLow"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	formatCurrency(tempVal2, tempString2, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageDailyHighLow, BUF_SIZE, "Daily High: $ %s  -  Daily Low: $ %s", tempString, tempString2);

	// Year High/Low
	tempVal = doc[0]["yearHigh"].as<double>();
	tempVal2 = doc[0]["yearLow"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	formatCurrency(tempVal2, tempString2, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageYearHighLow, BUF_SIZE, "Year High: $ %s  -  Year Low: $ %s", tempString, tempString2);

	// Open
	tempVal = doc[0]["open"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageOpen, BUF_SIZE, "Open: $ %s", tempString);

	// Volume
	tempVal = doc[0]["volume"].as<double>();
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageVolume, BUF_SIZE, "Volume: $ %s", tempString);

	// Bitcoin mined
	tempVal = doc[0]["sharesOutstanding"].as<double>();
	tempVal2 = tempVal / 21000000 * 100; // Current supply percentage
	formatCurrency(tempVal, tempString, MAX_NUMBER_SIZE); // Format number
	formatCurrency(tempVal2, tempString2, MAX_NUMBER_SIZE); // Format number
	snprintf(stripMessageBitcoinMined, BUF_SIZE, "Total Bitcoin mined: %s (%s%%)", tempString, tempString2);
}

// Getting Bitcoin data
bool getStockDataAPI() {
    char url[100]; // URL modificato per utilizzare HTTP
    sprintf(url, "http://financialmodelingprep.com/api/v3/quote/BTCUSD?apikey=%s", apiKey);
    http.begin(client, url); // Inizia una chiamata HTTP all'URL specificato
    if (http.GET() == HTTP_CODE_OK) {
        Serial.println("Response body: " + http.getString());
        JsonDocument doc; // Create the JSON object
		DeserializationError error = deserializeJson(doc, http.getString()); // Deserialize the JSON object
		if (error) { // Error while parsing the JSON
			Serial.printf("Error while parsing the JSON: %s\n", error.c_str());
			http.end();
			return false;
		}
		createStockDataMessage(doc); // Create the scrolling message
		http.end(); // Close connection
		return true;
    } else {
        Serial.printf("HTTP call error: %d\n", http.GET());
        http.end();
        return false;
    }
}

// Connecting to WiFi
bool connectToWiFi() {
	WiFi.begin(wiFiSSID, wiFiPassword); // Connecting to the WiFi
	byte maxTry = 50; // Maximum number of attempts to connect to WiFi
	byte count = 0; // Counter
	Serial.print("Connecting to WiFi");
	while (WiFi.status() != WL_CONNECTED) {
		if (count >= maxTry) {
			wiFiSSID[0] = '\0'; // Reset network SSID
			wiFiPassword[0] = '\0'; // Reset network password
			return false; // Connection failed
		}
		count++;
		Serial.print(".");
		delay(250);
	}
	Serial.println(" connected!");
	writeEEPROM(); // Save the network credentials
	return true; // Connection success
}

// Setup delle route
void setupRoutes() {
	server.serveStatic("/", LittleFS, "/").setDefaultFile("index.html"); // Serve web page
	server.onNotFound([](AsyncWebServerRequest *request) { // Page not found
		request->send(404);
	});

	// Connect to WiFi
	server.on("/connect", HTTP_GET, [](AsyncWebServerRequest *request) {
		if (!request->hasParam("ssid") || !request->hasParam("password")) { // Check required fields
			request->send(400, "application/json", "{\"status\":\"KO\"}"); // Response
			return;
		}
		stringCopy(wiFiSSID, request->getParam("ssid")->value().c_str(), 35); // Save the SSID
		stringCopy(wiFiPassword, request->getParam("password")->value().c_str(), 70); // Save the password
		Serial.print("SSID: ");
		Serial.println(wiFiSSID);
		Serial.print("Password: ");
		Serial.println(wiFiPassword);
		wiFiConnectionStatus = WIFI_TRY; // Trying to connect
		char jsonResponse[20]; // JSON response
		snprintf(jsonResponse, sizeof(jsonResponse), "{\"status\":\"%d\"}", wiFiConnectionStatus); // Create response
		request->send(200, "application/json", jsonResponse); // Response
		newDataToSaveToEEPROM = true; // New credentials
	});

	// Check the WiFi connection status
	server.on("/checkConnection", HTTP_GET, [](AsyncWebServerRequest *request) {
		char jsonResponse[20]; // JSON response
		snprintf(jsonResponse, sizeof(jsonResponse), "{\"status\":\"%d\"}", wiFiConnectionStatus);
		switch(wiFiConnectionStatus) {
			case WIFI_TRY:
				request->send(200, "application/json", jsonResponse); // Response
				break;
			case WIFI_OK:
				disableAccessPoint = true; // I need to disable the access point
				request->send(200, "application/json", jsonResponse); // Response
				break;
			case WIFI_KO:
				request->send(400, "application/json", jsonResponse); // Response
				break;
		}
	});

	// Send the list of networks
	server.on("/networks", HTTP_GET, [](AsyncWebServerRequest *request) {
		WiFi.scanNetworksAsync([request](int numNetworks) {
			JsonDocument doc; // JSON object
			JsonArray networks = doc["networks"].to<JsonArray>();
			for (int i = 0; i < numNetworks; i++) {
				JsonObject network = networks.add<JsonObject>();
				network["ssid"] = WiFi.SSID(i);
				network["signal"] = WiFi.RSSI(i);
			}
			size_t jsonLength = measureJson(doc) + 1; // Get the size of the JSON object
			char json[jsonLength];
			serializeJson(doc, json, jsonLength);
			request->send(200, "application/json", json); // Send the JSON object
		});
    });

	// Save the API key
	server.on("/apiKey", HTTP_GET, [](AsyncWebServerRequest *request) {
		if (!request->hasParam("apiKey")) { // Check if the API key is missing
        	request->send(400, "application/json", "{\"status\":\"KO\"}"); // Send the JSON object
        	return;
    	}
		stringCopy(apiKey, request->getParam("apiKey")->value().c_str(), 35); // Save the API key
		request->send(200, "application/json", "{\"status\":\"OK\"}"); // Send the JSON object
		Serial.println("API key changed");
		newDataToSaveToEEPROM = true; // New API key
	});

	// Get the values visibility settings
	server.on("/valuesSettings", HTTP_GET, [](AsyncWebServerRequest *request) {
		JsonDocument doc; // JSON object
		doc["currentPrice"] = currentPriceVisible ? "Y" : "N";
		doc["priceChange"] = priceChangeVisible ? "Y" : "N";
		doc["marketCap"] = marketCapVisible ? "Y" : "N";
		doc["dailyHighLow"] = dailyHighLowVisible ? "Y" : "N";
		doc["yearHighLow"] = yearHighLowVisible ? "Y" : "N";
		doc["openPrice"] = openPriceVisible ? "Y" : "N";
		doc["volume"] = volumeVisible ? "Y" : "N";
		doc["bitcoinMined"] = bitcoinMinedVisible ? "Y" : "N";
		doc["formatType"] = formatType == FORMAT_US ? "US" : "EU";
		size_t jsonLength = measureJson(doc) + 1; // Get the size of the JSON object
		char json[jsonLength];
		serializeJson(doc, json, jsonLength);
		request->send(200, "application/json", json); // Send the JSON object
	});

