Brumaombra/led-matrix-bitcoin-ticker-esp8266/src/main.cpp
	// Save the values visibility settings
	server.on("/saveValuesSettings", HTTP_GET, [](AsyncWebServerRequest *request) {
		if (request->hasParam("currentPrice"))
			currentPriceVisible = request->getParam("currentPrice")->value() == "Y";
		if (request->hasParam("priceChange"))
			priceChangeVisible = request->getParam("priceChange")->value() == "Y";
		if (request->hasParam("marketCap"))
			marketCapVisible = request->getParam("marketCap")->value() == "Y";
		if (request->hasParam("dailyHighLow"))
			dailyHighLowVisible = request->getParam("dailyHighLow")->value() == "Y";
		if (request->hasParam("yearHighLow"))
			yearHighLowVisible = request->getParam("yearHighLow")->value() == "Y";
		if (request->hasParam("openPrice"))
			openPriceVisible = request->getParam("openPrice")->value() == "Y";
		if (request->hasParam("volume"))
			volumeVisible = request->getParam("volume")->value() == "Y";
		if (request->hasParam("bitcoinMined"))
			bitcoinMinedVisible = request->getParam("bitcoinMined")->value() == "Y";
		if (request->hasParam("formatType"))
			formatType = request->getParam("formatType")->value() == "US" ? FORMAT_US : FORMAT_EU;
		if (request->hasParam("priceScrollPause"))
			priceScrollPause = request->getParam("priceScrollPause")->value().toInt();
		request->send(200, "application/json", "{\"status\":\"OK\"}");
		Serial.println("Values settings changed");
		newDataToSaveToEEPROM = true; // New settings
		writeEEPROM(); // Save the settings
	});
}

// Setting up the access point
bool setupAccessPoint() {
	if (accessPointEnabled) // Check if already enabled
		return true; // If enabled exit the function
	accessPointEnabled = WiFi.softAP(accessPointSSID); // Start the access point
	if (!accessPointEnabled) // Check if enabled
		return false; // If not enabled exit the function
	return true; // Access point enabled
}

// Manage WiFi connection
bool manageWiFiConnection() {
	if (wiFiConnectionStatus == WIFI_TRY) { // Check if already trying to connect
		if (connectToWiFi()) { // Connecting to WiFi
			wiFiConnectionStatus = WIFI_OK; // Update connection status
			return true; // Connection success
		} else {
			wiFiConnectionStatus = WIFI_KO; // Update connection status
			return false; // Connection failed
		}
	}

	// Every 2 seconds
	if (millis() - timestampWiFiConnection > 2000) {
		timestampWiFiConnection = millis(); // Save timestamp
		if (disableAccessPoint && accessPointEnabled) { // Check if I need to disable the access point
			accessPointEnabled = !WiFi.softAPdisconnect(); // Disable access point
			if (!accessPointEnabled) // Check if disabled
				disableAccessPoint = false; // Mark as disabled
		}
		if (WiFi.status() == WL_CONNECTED) // Check if connected to WiFi
			return true; // If connected exit the function
		if (wiFiSSID[0] != '\0' && wiFiPassword[0] != '\0') { // Check if credentials are already present
			if (connectToWiFi()) // Connecting to WiFi
				return true; // Connection success
			else
				setupAccessPoint(); // Setup access point
		} else {
			setupAccessPoint(); // Setup access point
		}
		return false; // Connection failed
	}
	return true; // Connection success
}

// Check if connected to WiFi
bool checkWifiConnection() {
	if (WiFi.status() != WL_CONNECTED) {
		const char errorMessage[] = "Not connected to Wi-Fi. Use the 'Bitcoin-Ticker' access point to enter the Wi-Fi credentials.";
		Serial.println(errorMessage);
		printOnLedMatrix(errorMessage, sizeof(errorMessage)); // Print the message on the matrix
		return false; // Not connected
	}
	return true; // Connected
}

// Call the API to get the data
bool callAPI() {
	currentMillis = millis();
	if (currentMillis - timestampStockData > 360000 || timestampStockData == 0) { // Call the API every 6 minutes (To limit usage)
		if (apiKey[0] == '\0') { // Check if API key is present
			const char errorMessageApi[] = "API key is not present. Use the web page to insert the key and try again.";
			Serial.println(errorMessageApi);
			printOnLedMatrix(errorMessageApi, sizeof(errorMessageApi)); // Print the message on the matrix
			return false; // If error, return false
		}
		Serial.println("Calling the API");
		if (!getStockDataAPI()) { // Getting the data
			const char errorMessageServer[] = "Error while calling the API. Retrying...";
			Serial.println(errorMessageServer);
			printOnLedMatrix(errorMessageServer, sizeof(errorMessageServer)); // Print the message on the matrix
			return false; // If error, return false
		}
		writeEEPROM(); // Save the apiKey to the EEPROM
		timestampStockData = currentMillis; // Save timestamp
	}
	return true; // If no error, return true
}

// Manage the LED matrix
void manageLedMatrix() {
	if (!P.displayAnimate())
		return; // If scrolling, exit the function
	if (!checkWifiConnection()) // Check if connected to WiFi
		return; // If not connected, exit the function
	if (!callAPI()) // Call the API
		return; // If error, exit the function

	// Print messagges
	switch (switchText) {
		case PRINT_PRICE:
			Serial.println("Section: PRICE");
			if (currentPriceVisible) // Check if current price is visible
				printOnLedMatrix(stripMessagePrice, BUF_SIZE, priceScrollPause); // Print the message on the matrix
			switchText = PRINT_CHANGE;
			break;

		case PRINT_CHANGE:
			Serial.println("Section: CHANGE");
			if (priceChangeVisible) // Check if price change is visible
				printOnLedMatrix(stripMessageDailyChange, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_MARKET_CAP;
			break;
		
		case PRINT_MARKET_CAP:
			Serial.println("Section: MARKET CAP");
			if (marketCapVisible) // Check if market cap is visible
				printOnLedMatrix(stripMessageMarketCap, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_DAILY_HIGH_LOW;
			break;

		case PRINT_DAILY_HIGH_LOW:
			Serial.println("Section: DAILY HIGHLOW");
			if (dailyHighLowVisible) // Check if daily high/low is visible
				printOnLedMatrix(stripMessageDailyHighLow, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_YEAR_HIGH_LOW;
			break;

		case PRINT_YEAR_HIGH_LOW:
			Serial.println("Section: YEAR HIGHLOW");
			if (yearHighLowVisible) // Check if year high/low is visible
				printOnLedMatrix(stripMessageYearHighLow, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_OPEN;
			break;

