Brumaombra/led-matrix-bitcoin-ticker-esp8266/src/main.cpp
		case PRINT_OPEN:
			Serial.println("Section: OPEN");
			if (openPriceVisible) // Check if open price is visible
				printOnLedMatrix(stripMessageOpen, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_VOLUME;
			break;
			
		case PRINT_VOLUME:
			Serial.println("Section: VOLUME");
			if (volumeVisible) // Check if volume is visible
				printOnLedMatrix(stripMessageVolume, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_BITCOIN_MINED;
			break;
		
		case PRINT_BITCOIN_MINED:
			Serial.println("Section: MINED");
			if (bitcoinMinedVisible) // Check if bitcoin mined is visible
				printOnLedMatrix(stripMessageBitcoinMined, BUF_SIZE); // Print the message on the matrix
			switchText = PRINT_PRICE;
			break;
	}
}

// Setup the web client
void setupWebClient() {
    http.setTimeout(5000); // Set timeout
}

// Setup the LED matrix
void setupLedMatrix() {
	P.begin(); // Start the LED matrix
	printOnLedMatrix("Initializing...", BUF_SIZE); // Print the message on the matrix
}

// Setup LittleFS
bool setupLittleFS() {
	if (!LittleFS.begin()) { // Check if LittleFS is mounted
		Serial.println("An Error has occurred while mounting LittleFS");
		return false;
	} else {
		return true;
	}
}

// Setup server
void setupServer() {
	setupRoutes(); // Setup routes
	server.begin(); // Start the server
}

// read the already saved settings from the EEPROM
void readSavedSetting(JsonDocument doc) {
	if (doc.containsKey("apiKey") && !doc["apiKey"].isNull()) // Check if the API key is present
		stringCopy(apiKey, doc["apiKey"], sizeof(apiKey));
	if (doc.containsKey("ssid") && !doc["ssid"].isNull()) // Check if the WiFi SSID is present
		stringCopy(wiFiSSID, doc["ssid"], sizeof(wiFiSSID));
	if (doc.containsKey("password") && !doc["password"].isNull()) // Check if the WiFi password is present
		stringCopy(wiFiPassword, doc["password"], sizeof(wiFiPassword));
	if (doc.containsKey("currentPrice")) // Check if the current price is present
		currentPriceVisible = doc["currentPrice"].as<bool>();
	if (doc.containsKey("priceChange")) // Check if the price change is present
		priceChangeVisible = doc["priceChange"].as<bool>();
	if (doc.containsKey("marketCap")) // Check if the market cap is present
		marketCapVisible = doc["marketCap"].as<bool>();
	if (doc.containsKey("dailyHighLow")) // Check if the daily high/low is present
		dailyHighLowVisible = doc["dailyHighLow"].as<bool>();
	if (doc.containsKey("yearHighLow")) // Check if the year high/low is present
		yearHighLowVisible = doc["yearHighLow"].as<bool>();
	if (doc.containsKey("openPrice")) // Check if the open price is present
		openPriceVisible = doc["openPrice"].as<bool>();
	if (doc.containsKey("volume")) // Check if the volume is present
		volumeVisible = doc["volume"].as<bool>();
	if (doc.containsKey("bitcoinMined")) // Check if the bitcoin mined is present
		bitcoinMinedVisible = doc["bitcoinMined"].as<bool>();
	if (doc.containsKey("formatType") && !doc["formatType"].isNull()) // Check if the format type is present
		formatType = doc["formatType"].as<formatNum>();
	if (doc.containsKey("priceScrollPause") && !doc["priceScrollPause"].isNull()) // Check if the price scroll pause is present
		priceScrollPause = doc["priceScrollPause"].as<uint16_t>();
}

// Setup EEPROM
void setupEEPROM() {
	EEPROM.begin(EEPROM_SIZE); // Start the EEPROM
	JsonDocument doc; // JSON object
	if (!readEEPROM(doc)) // Read the EEPROM
		return; // If error, exit the function
	readSavedSetting(doc); // Read the saved settings
	Serial.println("EEPROM data loaded");
}

// Setup
void setup() {
	Serial.begin(9600); // Start serial
	setupLittleFS(); // Setup LittleFS
	setupEEPROM(); // Setup EEPROM
	setupServer(); // Setup server
	manageWiFiConnection(); // Manage WiFi connection
	setupWebClient(); // Setup web client
	setupLedMatrix(); // Setup LED matrix
}

// Loop
void loop() {
	manageWiFiConnection(); // Manage WiFi connection
	manageLedMatrix(); // Manage the LED matrix
}